In [1]:
import pandas as pd
import numpy as np
from pathlib import Path

In [26]:
INPUT_C_10 = "../DATAS/ANSTAT2021_clusters.csv"
INPUT_C_20 = "../DATAS/ANSTAT2021_clusters_20.csv"
INPUT_C_100 = "../DATAS/ANSTAT2021_clusters_PC.csv"
INPUT_C_100_R = "../DATAS/ANSTAT2021_clusters_100.csv"

In [27]:
df_10 = pd.read_csv(INPUT_C_10)
df_20 = pd.read_csv(INPUT_C_20)
df_100 = pd.read_csv(INPUT_C_100)
df_100_R = pd.read_csv(INPUT_C_100_R)

In [38]:
df_10[df_10["cluster"] == 0]

,cluster,age_num,sex,marital_status,city,milieu_resid,region_name,bancarise
4291,0,18,Féminin,Célibataire,ANYAMA,Rural,AUTONOME D'ABIDJAN,0
4294,0,16,Féminin,Célibataire,ANYAMA,Rural,AUTONOME D'ABIDJAN,0
4295,0,11,Féminin,Célibataire,ANYAMA,Rural,AUTONOME D'ABIDJAN,0
4296,0,11,Féminin,Célibataire,ANYAMA,Rural,AUTONOME D'ABIDJAN,0
4302,0,11,Féminin,Célibataire,ANYAMA,Rural,AUTONOME D'ABIDJAN,0
...,...,...,...,...,...,...,...,...
64442,0,15,Féminin,Célibataire,TIEMELEKRO,Rural,MORONOU,0
64446,0,4,Féminin,Célibataire,TIEMELEKRO,Rural,MORONOU,0
64462,0,9,Féminin,Célibataire,TIEMELEKRO,Rural,MORONOU,0
64463,0,6,Féminin,Célibataire,TIEMELEKRO,Rural,MORONOU,0
64467,0,12,Féminin,Célibataire,TIEMELEKRO,Rural,MORONOU,0

In [13]:
df_20[df_20["cluster"] == 0]

,cluster,age_num,sex,marital_status,city,milieu_resid,region_name,bancarise
4291,0,18,Féminin,Célibataire,ANYAMA,Rural,AUTONOME D'ABIDJAN,0
4294,0,16,Féminin,Célibataire,ANYAMA,Rural,AUTONOME D'ABIDJAN,0
4295,0,11,Féminin,Célibataire,ANYAMA,Rural,AUTONOME D'ABIDJAN,0
4296,0,11,Féminin,Célibataire,ANYAMA,Rural,AUTONOME D'ABIDJAN,0
4302,0,11,Féminin,Célibataire,ANYAMA,Rural,AUTONOME D'ABIDJAN,0
...,...,...,...,...,...,...,...,...
64442,0,15,Féminin,Célibataire,TIEMELEKRO,Rural,MORONOU,0
64446,0,4,Féminin,Célibataire,TIEMELEKRO,Rural,MORONOU,0
64462,0,9,Féminin,Célibataire,TIEMELEKRO,Rural,MORONOU,0
64463,0,6,Féminin,Célibataire,TIEMELEKRO,Rural,MORONOU,0
64467,0,12,Féminin,Célibataire,TIEMELEKRO,Rural,MORONOU,0

In [11]:
df_100[df_100["cluster"] == 0]

,cluster,age_num,sex,marital_status,city,milieu_resid,region_name,bancarise
23053,0,7,Féminin,Célibataire,BENGASSOU,Rural,N'ZI,0
23056,0,5,Féminin,Célibataire,BENGASSOU,Rural,N'ZI,0
23058,0,8,Féminin,Célibataire,BENGASSOU,Rural,N'ZI,0
23064,0,9,Féminin,Célibataire,BENGASSOU,Rural,N'ZI,0
23067,0,4,Féminin,Célibataire,BENGASSOU,Rural,N'ZI,0
...,...,...,...,...,...,...,...,...
24396,0,8,Féminin,Célibataire,KOUASSI-KOUASSIKRO,Rural,N'ZI,0
24401,0,11,Féminin,Célibataire,KOUASSI-KOUASSIKRO,Rural,N'ZI,0
24406,0,13,Féminin,Célibataire,KOUASSI-KOUASSIKRO,Rural,N'ZI,0
24407,0,13,Féminin,Célibataire,KOUASSI-KOUASSIKRO,Rural,N'ZI,0
24409,0,2,Féminin,Célibataire,KOUASSI-KOUASSIKRO,Rural,N'ZI,0

In [28]:
df_100_R[df_100_R["cluster"] == 0]

       cluster  age_num       sex marital_status        city  bancarise
1            0       17   Féminin    Célibataire     ABIDJAN          0
2            0       15  Masculin    Célibataire     ABIDJAN          0
3            0       12   Féminin    Célibataire     ABIDJAN          0
6            0        3  Masculin    Célibataire     ABIDJAN          0
7            0        1   Féminin    Célibataire     ABIDJAN          0
...        ...      ...       ...            ...         ...        ...
64467        0       12   Féminin    Célibataire  TIEMELEKRO          0
64469        0       11  Masculin    Célibataire  TIEMELEKRO          0
64470        0        7  Masculin    Célibataire  TIEMELEKRO          0
64471        0       10  Masculin    Célibataire  TIEMELEKRO          0
64472        0        4  Masculin    Célibataire  TIEMELEKRO          0

[39116 rows x 6 columns]

In [36]:
df_100_R[df_10["cluster"] == 4]

       cluster  age_num       sex marital_status        city  bancarise
4178         1       29  Masculin       Marié(e)      ANYAMA          1
4184         1       50  Masculin       Marié(e)      ANYAMA          1
4200         1       55  Masculin       Marié(e)      ANYAMA          1
4203         1       38  Masculin       Marié(e)      ANYAMA          1
4226         1       30  Masculin       Marié(e)      ANYAMA          1
...        ...      ...       ...            ...         ...        ...
64450        1       56  Masculin       Marié(e)  TIEMELEKRO          1
64453        1       56  Masculin       Marié(e)  TIEMELEKRO          1
64459        1       55  Masculin       Marié(e)  TIEMELEKRO          1
64461        1       36  Masculin       Marié(e)  TIEMELEKRO          1
64473        1       36  Masculin       Marié(e)  TIEMELEKRO          1

[6638 rows x 6 columns]

In [25]:
df_20[df_100["cluster"] == 10]

,cluster,age_num,sex,marital_status,city,milieu_resid,region_name,bancarise
4290,9,44,Féminin,Célibataire,ANYAMA,Rural,AUTONOME D'ABIDJAN,1
4300,9,23,Féminin,Célibataire,ANYAMA,Rural,AUTONOME D'ABIDJAN,1
4301,9,19,Féminin,Célibataire,ANYAMA,Rural,AUTONOME D'ABIDJAN,1
4317,9,17,Féminin,Célibataire,ANYAMA,Rural,AUTONOME D'ABIDJAN,1
4342,9,19,Féminin,Célibataire,ANYAMA,Rural,AUTONOME D'ABIDJAN,1
...,...,...,...,...,...,...,...,...
64271,9,18,Féminin,Célibataire,M'BATTO,Rural,MORONOU,1
64273,9,39,Féminin,Célibataire,M'BATTO,Rural,MORONOU,1
64315,9,23,Féminin,Union libre,M'BATTO,Rural,MORONOU,1
64389,9,44,Féminin,Célibataire,TIEMELEKRO,Rural,MORONOU,1
64418,4,27,Féminin,Union libre,TIEMELEKRO,Rural,MORONOU,1